load-tests/high-load.yml
# Artillery Load Test - High Load (1000 vehicles)
#
# Simulates:
# - 1000 vehicles sending GPS updates every 30 seconds
# - 500 handhelds sending GPS updates every 10 seconds
# - Duration: 10 minutes
# - Expected: P95 latency < 3 seconds, error rate < 0.1%
#
# **Validates: Requirements 14.1, 14.2**

config:
  target: "https://{{ $processEnvironment.IOT_ENDPOINT }}"
  phases:
    - duration: 60
      arrivalRate: 20
      name: "Warm up"
    - duration: 600
      arrivalRate: 100
      name: "Sustained load"
  processor: "./load-test-processor.js"
  variables:
    vehicleCount: 1000
    handheldCount: 500

scenarios:
  - name: "Vehicle GPS Updates"
    weight: 67
    flow:
      - function: "generateVehicleEvent"
      - publish:
          topic: "v1/gps/vehicle/{{ vehicleId }}"
          payload: "{{ vehicleEvent }}"
      - think: 30

  - name: "Handheld GPS Updates"
    weight: 33
    flow:
      - function: "generateHandheldEvent"
      - publish:
          topic: "v1/gps/handheld/{{ handheldId }}"
          payload: "{{ handheldEvent }}"
      - think: 10